ammaryouns/IoT_gateway/Morrison/Drivers/TM4CI2CTiva.c
//==============================================================================
// Start of file
//==============================================================================
//
//  TM4CI2CTiva.c
//
//  Copyright (C) 2016 by Industrial Scientific.
//
//  This document and all information contained within are confidential and
//  proprietary property of Industrial Scientific Corporation. All rights
//  reserved. It is not to be reproduced or reused without the prior approval
//  of Industrial Scientific Corporation.
//
//==============================================================================
//  FILE INFORMATION
//==============================================================================
//
//  Source:        TM4CI2CTiva.c
//
//  Project:       Morrison
//
//  Author:        Muhammad Shuaib
//
//  Date:          2016/21/11
//
//  Revision:      1.0
//
//==============================================================================
//  FILE DESCRIPTION
//==============================================================================
//
//! \file
//! This is I2C Device Driver module.
//
//==============================================================================
//  REVISION HISTORY
//==============================================================================
//
// Revision: 1.0 2016/21/11 Muhammad Shuaib
//           Initial Version
//
//==============================================================================

//==============================================================================
//  INCLUDES
//==============================================================================

#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <xdc/runtime/Error.h>
#include <xdc/runtime/Assert.h>
#include <xdc/runtime/Diags.h>
#include <xdc/runtime/Log.h>
#include <xdc/runtime/Types.h>
#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/family/arm/m3/Hwi.h>
#include <ti/sysbios/knl/Semaphore.h>
#include <inc/hw_types.h>
#include <driverlib/i2c.h>
#include "TM4CI2CTiva.h"
//
//==============================================================================
// CONSTANTAS, DEFINES AND MACROS
//==============================================================================

//==============================================================================
// Specific I2C CMD MACROs that are not defined in I2C.h are defined here. Their
// equivalent values are taken from the existing MACROs in I2C.h
//==============================================================================
 
#ifndef I2C_MASTER_CMD_BURST_RECEIVE_START_NACK
#define I2C_MASTER_CMD_BURST_RECEIVE_START_NACK  I2C_MASTER_CMD_BURST_SEND_START
#endif

#ifndef I2C_MASTER_CMD_BURST_RECEIVE_STOP
#define I2C_MASTER_CMD_BURST_RECEIVE_STOP        I2C_MASTER_CMD_BURST_RECEIVE_ERROR_STOP
#endif

#ifndef I2C_MASTER_CMD_BURST_RECEIVE_CONT_NACK
#define I2C_MASTER_CMD_BURST_RECEIVE_CONT_NACK   I2C_MASTER_CMD_BURST_SEND_CONT
#endif


static const uint32_t bitRate[] = {
    false,  //  I2C_100kHz = 0 
    true    //  I2C_400kHz = 1 
};

//==============================================================================
// LOCAL function PROTOTYPES
//==============================================================================

static void  I2CTiva_blockingCallback(I2C_Handle handle, I2C_Transaction *msg,
                                      bool transferStatus);


//==============================================================================
// LOCAL FUNCTIONS PROTOTYPES
//==============================================================================

//==============================================================================
// LOCAL FUNCTIONS DEFINITIONS
//==============================================================================

//==============================================================================
// GLOBAL  FUNCTIONS PROTOTYPES
//==============================================================================

//==============================================================================
// LOCAL FUNCTIONS IMPLEMENTATION
//==============================================================================

//==============================================================================
//
// static void I2CTiva_primeTransfer(I2CTiva_Object  *object,I2CTiva_HWAttrs const *hwAttrs,
//                                  I2C_Transaction *transaction)
//
//  Author:     Muhammad Shuaib
//  Date:       2016/21/11
//
//! This function initializes the I2C
//
//==============================================================================

static void I2CTiva_primeTransfer(I2CTiva_Object  *object,
                                  I2CTiva_HWAttrs const *hwAttrs,
                                  I2C_Transaction *transaction)
{
    // Store the new internal counters and pointers 
    object->currentTransaction = transaction;

    object->writeBufIdx = transaction->writeBuf;
    object->writeCountIdx = transaction->writeCount;

    object->readBufIdx = transaction->readBuf;
    object->readCountIdx = transaction->readCount;

    Log_print2(Diags_USER1,
               "I2C:(%p) Starting transaction to slave: 0x%x",
               hwAttrs->baseAddr,
               object->currentTransaction->slaveAddress);

    // Start transfer in Transmit mode 
    if (object->writeCountIdx) {
        // Specify the I2C slave address 
        I2CMasterSlaveAddrSet(hwAttrs->baseAddr,
                              object->currentTransaction->slaveAddress, false);
        // Update the I2C mode 
        object->mode = I2CTiva_WRITE_MODE;

        Log_print3(Diags_USER2,
                   "I2C:(%p) I2CTiva_IDLE_MODE: Data to write: 0x%x; To Slave: 0x%x",
                   hwAttrs->baseAddr,
                   *(object->writeBufIdx),
                   object->currentTransaction->slaveAddress);

        // Write data contents into data register 
        I2CMasterDataPut(hwAttrs->baseAddr, *((object->writeBufIdx)++));

        // Start the I2C transfer in master transmit mode 
        I2CMasterControl(hwAttrs->baseAddr, I2C_MASTER_CMD_BURST_SEND_START);

        Log_print1(Diags_USER2,
                   "I2C:(%p) I2CTiva_IDLE_MODE: -> I2CTiva_WRITE_MODE; Writing w/ START",
                   hwAttrs->baseAddr);
    }

