ammaryouns/IoT_gateway/Morrison/Drivers/TM4CI2CTiva.c
    // Start transfer in Receive mode 
    else {
        // Specify the I2C slave address 
        I2CMasterSlaveAddrSet(hwAttrs->baseAddr,
                              object->currentTransaction->slaveAddress,
                              true);

        // Update the I2C mode 
        object->mode = I2CTiva_READ_MODE;

        if (object->readCountIdx < 2) {
            // Start the I2C transfer in master receive mode 
            I2CMasterControl(hwAttrs->baseAddr,
                             I2C_MASTER_CMD_BURST_RECEIVE_START_NACK);

            Log_print1(Diags_USER2,
                       "I2C:(%p) I2CTiva_IDLE_MODE: -> I2CTiva_READ_MODE; Reading w/ "
                       "NACK",
                       hwAttrs->baseAddr);
        }
        else {
            // Start the I2C transfer in master receive mode 
            I2CMasterControl(hwAttrs->baseAddr,
                    I2C_MASTER_CMD_BURST_RECEIVE_START);

            Log_print1(Diags_USER2,
                       "I2C:(%p) I2CTiva_IDLE_MODE: -> I2CTiva_READ_MODE; Reading w/ ACK",
                       hwAttrs->baseAddr);
        }
    }
}

//==============================================================================
// GLOBAL  function PROTOTYPES
//==============================================================================

void         I2CTiva_close(I2C_Handle handle);
int          I2CTiva_control(I2C_Handle handle, unsigned int cmd, void *arg);
void         I2CTiva_init(I2C_Handle handle);
I2C_Handle   I2CTiva_open(I2C_Handle handle, I2C_Params *params);
bool         I2CTiva_transfer(I2C_Handle handle, I2C_Transaction *transaction);
static void  I2CTiva_primeTransfer(I2CTiva_Object        *object,
                                   I2CTiva_HWAttrs const *hwAttrs,
                                   I2C_Transaction       *transaction);
// I2C function table for I2CTiva implementation 
const I2C_FxnTable I2CTiva_fxnTable = {
    I2CTiva_close,
    I2CTiva_control,
    I2CTiva_init,
    I2CTiva_open,
    I2CTiva_transfer
};

//==============================================================================
// GLOBAL  FUNCTIONS IMPLEMENTATIONS
//==============================================================================

//==============================================================================
//
//  void I2CTiva_close(I2C_Handle handle)
//
//  Author:     Muhammad Shuaib
//  Date:       2016/21/11
//
//! This function closes I2C driver
//
//============================================================================== 

void I2CTiva_close(I2C_Handle handle)
{
    I2CTiva_Object         *object = handle->object;
    I2CTiva_HWAttrs const  *hwAttrs = handle->hwAttrs;

    // Check to see if a I2C transaction is in progress 
    Assert_isTrue(object->headPtr == NULL, NULL);

    // Mask I2C interrupts 
    I2CMasterIntDisable(hwAttrs->baseAddr);

    // Disable the I2C Master 
    I2CMasterDisable(hwAttrs->baseAddr);

    Hwi_destruct(&(object->hwi));
    Semaphore_destruct(&(object->mutex));
    if (object->transferMode == I2C_MODE_BLOCKING) {
        Semaphore_destruct(&(object->transferComplete));
    }

    object->isOpen = false;

    Log_print1(Diags_USER1, "I2C: Object closed 0x%x", hwAttrs->baseAddr);

    return;
}

//==============================================================================
//
//  static void I2CTiva_completeTransfer(I2C_Handle handle)
//
//  Author:     Muhammad Shuaib
//  Date:       2016/21/11
//
//! This function performs the I2C tranfser
//
//============================================================================== 

static void I2CTiva_completeTransfer(I2C_Handle handle)
{
    // Get the pointer to the object 
    I2CTiva_Object         *object = handle->object;

    Log_print1(Diags_USER2, "I2C:(%p) ISR Transfer Complete",
               ((I2CTiva_HWAttrs const *)(handle->hwAttrs))->baseAddr);

    
    // Perform callback in a HWI context, thus any tasks or SWIs
    //  made ready to run won't start until the interrupt has
    // finished
     
    object->transferCallbackFxn(handle, object->currentTransaction,
                                !((bool)object->mode));

    // See if we need to process any other transactions 
    if (object->headPtr == object->tailPtr) {
        // No other transactions need to occur 
        object->currentTransaction = NULL;
        object->headPtr = NULL;

        Log_print1(Diags_USER2,
                   "I2C:(%p) ISR No other I2C transaction in queue",
                   ((I2CTiva_HWAttrs const *)(handle->hwAttrs))->baseAddr);
    }
    else {
        // Another transfer needs to take place 
        object->headPtr = object->headPtr->nextPtr;

        Log_print2(Diags_USER2,
                   "I2C:(%p) ISR Priming next I2C transaction (%p) from queue",
                   ((I2CTiva_HWAttrs const *)(handle->hwAttrs))->baseAddr,
                   (UArg)object->headPtr);

        I2CTiva_primeTransfer(object, (I2CTiva_HWAttrs const *)handle->hwAttrs,
                              object->headPtr);
    }
}

//==============================================================================
//
//  int I2CTiva_control(I2C_Handle handle, unsigned int cmd, void *arg)
//
//  Author:     Muhammad Shuaib
//  Date:       2016/21/11
//
//! This function is used for sending control data to I2C module
//
//============================================================================== 

int I2CTiva_control(I2C_Handle handle, unsigned int cmd, void *arg)
{
	// No implementation yet 
	return (I2C_STATUS_UNDEFINEDCMD);
}

//==============================================================================
//
//  static void I2CTiva_hwiFxn(UArg arg)
//
//  Author:     Muhammad Shuaib
//  Date:       2016/21/11
//
//! Hwi interrupt handler to service the I2C peripheral.The handler is a generic handler for a I2C object.
//
//============================================================================== 

static void I2CTiva_hwiFxn(UArg arg)
{
    // Get the pointer to the object and hwAttrs 
    I2CTiva_Object         *object = ((I2C_Handle)arg)->object;
    I2CTiva_HWAttrs const  *hwAttrs = ((I2C_Handle)arg)->hwAttrs;
    uint32_t                errStatus;

    // Get the interrupt status of the I2C controller 
    errStatus = I2CMasterErr(hwAttrs->baseAddr);

    // Clear interrupt source to avoid additional interrupts 
    I2CMasterIntClear(hwAttrs->baseAddr);

    // Check for I2C Errors 
    if ((errStatus == I2C_MASTER_ERR_NONE) || (object->mode == I2CTiva_ERROR)) {
        // No errors, now check what we need to do next 
        switch (object->mode) {
            //
            //  ERROR case is OK because if an Error is detected, a STOP bit is
            //  sent; which in turn will call another interrupt. This interrupt
            //  call will then post the transferComplete semaphore to unblock the
            //  I2C_transfer function
             
            case I2CTiva_ERROR:
            case I2CTiva_IDLE_MODE:
                I2CTiva_completeTransfer((I2C_Handle) arg);
                break;

            case I2CTiva_WRITE_MODE:
                // Decrement write Counter 
                object->writeCountIdx--;

