ammaryouns/IoT_gateway/Morrison/Drivers/TM4CI2CTiva.c
                // Check if more data needs to be sent 
                if (object->writeCountIdx) {
                    Log_print3(Diags_USER2,
                               "I2C:(%p) ISR I2CTiva_WRITE_MODE: Data to write: "
                               "0x%x; To slave: 0x%x",
                               hwAttrs->baseAddr,
                               *(object->writeBufIdx),
                               object->currentTransaction->slaveAddress);

                    // Write data contents into data register 
                    I2CMasterDataPut(hwAttrs->baseAddr, *(object->writeBufIdx));
                    object->writeBufIdx++;

                    if ((object->writeCountIdx < 2) && !(object->readCountIdx)) {
                        // Everything has been sent, nothing to receive 
                        // Next state: Idle mode 
                        object->mode = I2CTiva_IDLE_MODE;

                        // Send last byte with STOP bit 
                        I2CMasterControl(hwAttrs->baseAddr,
                                         I2C_MASTER_CMD_BURST_SEND_FINISH);

                        Log_print1(Diags_USER2,
                                   "I2C:(%p) ISR I2CTiva_WRITE_MODE: ACK received; "
                                   "Writing w/ STOP bit",
                                   hwAttrs->baseAddr);
                    }
                    else {
                        //
                        //   Either there is more date to be transmitted or some
                        //  data needs to be received next
                         
                        I2CMasterControl(hwAttrs->baseAddr,
                                         I2C_MASTER_CMD_BURST_SEND_CONT);

                        Log_print1(Diags_USER2,
                                   "I2C:(%p) ISR I2CTiva_WRITE_MODE: ACK received; "
                                   "Writing",
                                   hwAttrs->baseAddr);
                    }
                }

                // At this point, we know that we need to receive data 
                else {
                    //
                    //   We need to check after we are done transmitting data, if
                    //   we need to receive any data.
                    //   In a corner case when we have only one byte transmitted
                    //  and no data to receive, the I2C will automatically send
                    //  the STOP bit. In other words, here we only need to check
                    //  if data needs to be received. If so, how much.
                     
                    if (object->readCountIdx) {
                        // Next state: Receive mode 
                        object->mode = I2CTiva_READ_MODE;

                        // Switch into Receive mode 
                        I2CMasterSlaveAddrSet(hwAttrs->baseAddr,
                                              object->currentTransaction->slaveAddress,
                                              true);

                        if (object->readCountIdx > 1) {
                            // Send a repeated START 
                            I2CMasterControl(hwAttrs->baseAddr,
                                             I2C_MASTER_CMD_BURST_RECEIVE_START);

                            Log_print1(Diags_USER2,
                                       "I2C:(%p) ISR I2CTiva_WRITE_MODE: -> "
                                       "I2CTiva_READ_MODE; Reading w/ RESTART and ACK",
                                       hwAttrs->baseAddr);
                        }
                        else {
                            //
                             //   Send a repeated START with a NACK since it's the
                             //   last byte to be received.
                             //   I2C_MASTER_CMD_BURST_RECEIVE_START_NACK is
                             //   is locally defined because there is no macro to
                             //   receive data and send a NACK after sending a
                             //   start bit (0x00000003)
                             
                            I2CMasterControl(hwAttrs->baseAddr,
                                             I2C_MASTER_CMD_BURST_RECEIVE_START_NACK);

                            Log_print1(Diags_USER2,
                                       "I2C:(%p) ISR I2CTiva_WRITE_MODE: -> "
                                       "I2CTiva_READ_MODE; Reading w/ RESTART and NACK",
                                       hwAttrs->baseAddr);
                        }
                    }
                    else {
                        // Done with all transmissions 
                        object->mode = I2CTiva_IDLE_MODE;
                        //
                         //   No more data needs to be received, so follow up with
                         //   a STOP bit
                         //   Again, there is no equivalent macro (0x00000004) so
                         //   I2C_MASTER_CMD_BURST_RECEIVE_STOP is used.
                         
                        I2CMasterControl(hwAttrs->baseAddr,
                                         I2C_MASTER_CMD_BURST_RECEIVE_STOP);

                        Log_print1(Diags_USER2,
                                   "I2C:(%p) ISR I2CTiva_WRITE_MODE: -> "
                                   "I2CTiva_IDLE_MODE; Sending STOP bit",
                                   hwAttrs->baseAddr);
                    }
                }
                break;

            case I2CTiva_READ_MODE:
                // Save the received data 
                *(object->readBufIdx) = I2CMasterDataGet(hwAttrs->baseAddr);

                Log_print2(Diags_USER2,
                           "I2C:(%p) ISR I2CTiva_READ_MODE: Read data byte: 0x%x",
                           hwAttrs->baseAddr,
                           *(object->readBufIdx));

                object->readBufIdx++;

                // Check if any data needs to be received 
                object->readCountIdx--;
                if (object->readCountIdx) {
                    if (object->readCountIdx > 1) {
                        // More data to be received 
                        I2CMasterControl(hwAttrs->baseAddr,
                                         I2C_MASTER_CMD_BURST_RECEIVE_CONT);

                        Log_print1(Diags_USER2,
                                   "I2C:(%p) ISR I2CTiva_READ_MODE: Reading w/ ACK",
                                   hwAttrs->baseAddr);
                    }
                    else {
                        //
                         //   Send NACK because it's the last byte to be received
                         //   There is no NACK macro equivalent (0x00000001) so
                         //   I2C_MASTER_CMD_BURST_RECEIVE_CONT_NACK is used
                         
                        I2CMasterControl(hwAttrs->baseAddr,
                                         I2C_MASTER_CMD_BURST_RECEIVE_CONT_NACK);

                        Log_print1(Diags_USER2,
                                   "I2C:(%p) ISR I2CTiva_READ_MODE: Reading w/ NACK",
                                   hwAttrs->baseAddr);
                    }
                }
                else {
                    // Next state: Idle mode 
                    object->mode = I2CTiva_IDLE_MODE;

                    //
                     //   No more data needs to be received, so follow up with a
                     //   STOP bit
                     //   Again, there is no equivalent macro (0x00000004) so
                     //   I2C_MASTER_CMD_BURST_RECEIVE_STOP is used
                     
                    I2CMasterControl(hwAttrs->baseAddr,
                                     I2C_MASTER_CMD_BURST_RECEIVE_STOP);

                    Log_print1(Diags_USER2,
                               "I2C:(%p) ISR I2CTiva_READ_MODE: -> I2CTiva_IDLE_MODE; "
                               "Sending STOP bit",
                               hwAttrs->baseAddr);
                }

                break;

            default:
                object->mode = I2CTiva_ERROR;
                break;
        }

