ammaryouns/IoT_gateway/Morrison/Drivers/TM4CI2CTiva.c
    }
    else {
        // Some sort of error happened! 
        object->mode = I2CTiva_ERROR;

        if (errStatus & (I2C_MASTER_ERR_ARB_LOST | I2C_MASTER_ERR_ADDR_ACK)) {
            I2CTiva_completeTransfer((I2C_Handle) arg);
        }
        else {
        // Try to send a STOP bit to end all I2C communications immediately 
        //
         //   I2C_MASTER_CMD_BURST_SEND_ERROR_STOP -and-
         //   I2C_MASTER_CMD_BURST_RECEIVE_ERROR_STOP
         //   have the same values
         
            I2CMasterControl(hwAttrs->baseAddr,
                             I2C_MASTER_CMD_BURST_SEND_ERROR_STOP);
        }

        Log_print2(Diags_USER1,
                   "I2C:(%p) ISR I2C Bus fault (Status Reg: 0x%x)",
                   hwAttrs->baseAddr,
                   errStatus);
    }

    return;
}


//==============================================================================
//
//  void I2CTiva_init(I2C_Handle handle)
//
//  Author:     Muhammad Shuaib
//  Date:       2016/21/11
//
//! This function initializes the I2C driver
//
//==============================================================================

void I2CTiva_init(I2C_Handle handle)
{
    // Mark the object as available 
    ((I2CTiva_Object *)(handle->object))->isOpen = false;
}

//==============================================================================
//
//  void I2CTiva_init(I2C_Handle handle)
//
//  Author:     Muhammad Shuaib
//  Date:       2016/21/11
//
//! This function opens the I2C driver
//
//==============================================================================

I2C_Handle I2CTiva_open(I2C_Handle handle, I2C_Params *params)
{
    unsigned int                key;
    Types_FreqHz                freq;
    I2CTiva_Object             *object = handle->object;
    I2CTiva_HWAttrs const      *hwAttrs = handle->hwAttrs;
    union {
        Semaphore_Params        semParams;
        Hwi_Params              hwiParams;
    } paramsUnion;

    // Determine if the device index was already opened 
    key = Hwi_disable();
    if(object->isOpen == true){
        Hwi_restore(key);
        return (NULL);
    }

    // Mark the handle as being used 
    object->isOpen = true;
    Hwi_restore(key);

    // Save parameters 
    object->transferMode = params->transferMode;
    object->transferCallbackFxn = params->transferCallbackFxn;

    // Create Hwi object for this I2C peripheral 
    Hwi_Params_init(&(paramsUnion.hwiParams));
    paramsUnion.hwiParams.arg = (UArg)handle;
    paramsUnion.hwiParams.priority = hwAttrs->intPriority;
    Hwi_construct(&(object->hwi), hwAttrs->intNum, I2CTiva_hwiFxn,
                  &(paramsUnion.hwiParams), NULL);

    //
     //   Create threadsafe handles for this I2C peripheral
     //   Semaphore to provide exclusive access to the I2C peripheral
     
    Semaphore_Params_init(&(paramsUnion.semParams));
    paramsUnion.semParams.mode = Semaphore_Mode_BINARY;
    Semaphore_construct(&(object->mutex), 1, &(paramsUnion.semParams));

    //
     //   Store a callback function that posts the transfer complete
     //   semaphore for synchronous mode
     
    if (object->transferMode == I2C_MODE_BLOCKING) {
        //
         //   Semaphore to cause the waiting task to block for the I2C
         //   to finish
         
        Semaphore_construct(&(object->transferComplete), 0,
                            &(paramsUnion.semParams));

        // Store internal callback function 
        object->transferCallbackFxn = I2CTiva_blockingCallback;
    }
    else {
        // Check to see if a callback function was defined for async mode 
        Assert_isTrue(object->transferCallbackFxn != NULL, NULL);
    }

    // Specify the idle state for this I2C peripheral 
    object->mode = I2CTiva_IDLE_MODE;

    // Clear the head pointer 
    object->headPtr = NULL;
    object->tailPtr = NULL;

    Log_print1(Diags_USER1, "I2C: Object created 0x%x", hwAttrs->baseAddr);

    // Set the I2C configuration 
    BIOS_getCpuFreq(&freq);
    I2CMasterInitExpClk(hwAttrs->baseAddr, freq.lo, bitRate[params->bitRate]);

    // Clear any pending interrupts 
    I2CMasterIntClear(hwAttrs->baseAddr);

    // Enable the I2C Master for operation 
    I2CMasterEnable(hwAttrs->baseAddr);

    // Unmask I2C interrupts 
    I2CMasterIntEnable(hwAttrs->baseAddr);

    // Return the address of the handle 
    return (handle);
}


//==============================================================================
//
//  void I2CTiva_init(I2C_Handle handle)
//
//  Author:     Muhammad Shuaib
//  Date:       2016/21/11
//
//! This function sets the control variable of the UART driver
//
//==============================================================================

bool I2CTiva_transfer(I2C_Handle handle, I2C_Transaction *transaction)
{
    unsigned int            key;
    bool                    ret = false;
    I2CTiva_Object         *object = handle->object;
    I2CTiva_HWAttrs const  *hwAttrs = handle->hwAttrs;

    // Check if anything needs to be written or read 
    if ((!transaction->writeCount) && (!transaction->readCount)) {
        // Nothing to write or read 
        return (ret);
    }

    if (object->transferMode == I2C_MODE_CALLBACK) {
        // Check if a transfer is in progress 
        key = Hwi_disable();
        if (object->headPtr) {
            // Transfer in progress 

            //
             //   Update the message pointed by the tailPtr to point to the next
             //   message in the queue
             
            object->tailPtr->nextPtr = transaction;

            // Update the tailPtr to point to the last message 
            object->tailPtr = transaction;

            // I2C is still being used 
            Hwi_restore(key);
            return (true);
        }
        else {
            // Store the headPtr indicating I2C is in use 
            object->headPtr = transaction;
            object->tailPtr = transaction;
        }
        Hwi_restore(key);
    }

