ammaryouns/IoT_gateway/Morrison/Drivers/TM4CI2CTiva.c
    // Acquire the lock for this particular I2C handle 
    Semaphore_pend(Semaphore_handle(&(object->mutex)), BIOS_WAIT_FOREVER);

    //
     //   I2CTiva_primeTransfer is a longer process and
     //   protection is needed from the I2C interrupt
     
    Hwi_disableInterrupt(hwAttrs->intNum);
    I2CTiva_primeTransfer(object, hwAttrs, transaction);
    Hwi_enableInterrupt(hwAttrs->intNum);

    if (object->transferMode == I2C_MODE_BLOCKING) {
        Log_print1(Diags_USER1,
                   "I2C:(%p) Pending on transferComplete semaphore",
                   hwAttrs->baseAddr);
        //
         //   Wait for the transfer to complete here.
         //   It's OK to block from here because the I2C's Hwi will unblock
         //   upon errors
         
        Semaphore_pend(Semaphore_handle(&(object->transferComplete)),
                                        BIOS_WAIT_FOREVER);

        Log_print1(Diags_USER1,
                   "I2C:(%p) Transaction completed",
                   hwAttrs->baseAddr);

        // Hwi handle has posted a 'transferComplete' check for Errors 
        if (object->mode == I2CTiva_IDLE_MODE) {
            Log_print1(Diags_USER1, "I2C:(%p) Transfer OK", hwAttrs->baseAddr);
            ret = true;
        }
    }
    else {
        // Always return true if in Asynchronous mode 
        ret = true;
    }

    // Release the lock for this particular I2C handle 
    Semaphore_post(Semaphore_handle(&(object->mutex)));

    // Return the number of bytes transfered by the I2C 
    return (ret);
}

//==============================================================================
//
//  void I2CTiva_init(I2C_Handle handle)
//
//  Author:     Muhammad Shuaib
//  Date:       2016/21/11
//
//! This function sets the control variable of the UART driver
//
//==============================================================================

static void I2CTiva_blockingCallback(I2C_Handle handle,
                                     I2C_Transaction *msg,
                                     bool transferStatus)
{
    I2CTiva_Object  *object = handle->object;

    Log_print1(Diags_USER1,
               "I2C:(%p) posting transferComplete semaphore",
               ((I2CTiva_HWAttrs const  *)(handle->hwAttrs))->baseAddr);

    // Indicate transfer complete 
    Semaphore_post(Semaphore_handle(&(object->transferComplete)));
}
